-------------------------------------------------------------------------------------------------
--Написать запрос в таблицу PHONE_CATALOG, выводящий суммарную стоимость партии телефонов, у которых дата поставки в период 1-15 сентябре 2024, красного цвета *RED* или зеленого цвета *GREEN* и есть возможность купить его в рассрочку.
-------------------------------------------------------------------------------------------------
select
sum(price * quantity) as sum_total
from phone_catalog
where 
date_delivery between to_date('2024-09-01', 'YYYY-MM-DD') and to_date('2024-09-15', 'YYYY-MM-DD')
and color in ('RED', 'GREEN')
and installment = 'Y';